Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 336, 336, 32)      896       
_________________________________________________________________
activation (Activation)      (None, 336, 336, 32)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 168, 168, 32)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 168, 168, 50)      40050     
_________________________________________________________________
activation_1 (Activation)    (None, 168, 168, 50)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 84, 84, 50)        0         
_________________________________________________________________
flatten (Flatten)            (None, 352800)            0         
_________________________________________________________________
dense (Dense)                (None, 500)               176400500 
_________________________________________________________________
activation_2 (Activation)    (None, 500)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                5010      
_________________________________________________________________
activation_3 (Activation)    (None, 10)                0         
=================================================================
Total params: 176,446,456
Trainable params: 176,446,456
Non-trainable params: 0
_________________________________________________________________
